In [2]:
import pandas as pd

In [1]:
!type examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [3]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [6]:
!type examples\ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [7]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [8]:
result = pd.read_table('examples/ex3.txt', sep="\s+")

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [9]:
!type examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [10]:
pd.read_csv('examples\ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
!type examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [14]:
result = pd.read_csv("examples/ex5.csv")
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [15]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [16]:
result = pd.read_csv("examples/ex5.csv", na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [18]:
setninels = {'message' : ['foo', 'NA'], 'something' : ['two']}
result = pd.read_csv("examples/ex5.csv", na_values = setninels)
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 1. 텍스트 파일 조금씩 읽어오기

In [19]:
pd.options.display.max_rows = 10

In [20]:
pd.read_csv('examples/ex6.csv')

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [21]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [42]:
chunker = pd.read_csv('examples/ex6.csv', chunksize = 1000)
chunker

In [43]:
tot = pd.Series([], dtype='float64')

for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)    
tot = tot.sort_values(ascending=False)

In [44]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

### 2. 데이터를 텍스트 형식으로 기록하기

In [45]:
data = pd.read_csv("examples/ex5.csv")
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
data.to_csv('examples/out.csv')

In [47]:
!type examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [50]:
import sys

data.to_csv(sys.stdout)

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [51]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [52]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [53]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [58]:
data.to_csv(sys.stdout, index=False, columns = ['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [60]:
dates = pd.date_range('1/1/2000', periods=7)

In [64]:
import numpy as np
ts = pd.Series(np.arange(7), index = dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [67]:
ts.to_csv('examples/tseries.csv', header = None)

In [68]:
!type examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

* Excel 파일 읽기

In [70]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [72]:
frame = pd.read_excel(xlsx, 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [76]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [79]:
frame.to_excel(writer, 'Sheet1')
writer.save()

In [83]:
# 다른방법
frame.to_excel('examples/ex2.xlsx', sheet_name='Sheet2')

## 데이터 정제 및 준비

### 1. 누락된 데이터 처리하기

In [84]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [86]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [88]:
string_data[0] = None

In [89]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [90]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### 1.1 누락된 데이터 골라내기

In [92]:
from numpy import nan as NA

In [93]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [94]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [95]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [96]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [97]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [98]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [101]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [100]:
data.dropna(axis=0, how='any')

     0    1    2
0  1.0  6.5  3.0

In [102]:
data.dropna(axis=0, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [103]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [104]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [118]:
df = pd.DataFrame(np.random.randn(7, 3))

In [119]:
df.iloc[:4, 1] = NA
df

          0         1         2
0  0.302053       NaN  0.221659
1 -0.463459       NaN -0.816549
2 -0.455859       NaN  1.851914
3 -0.291321       NaN  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [120]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.302053       NaN       NaN
1 -0.463459       NaN       NaN
2 -0.455859       NaN  1.851914
3 -0.291321       NaN  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [121]:
df.dropna()

          0         1         2
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

          0         1         2
2 -0.455859       NaN  1.851914
3 -0.291321       NaN  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [123]:
df

          0         1         2
0  0.302053       NaN       NaN
1 -0.463459       NaN       NaN
2 -0.455859       NaN  1.851914
3 -0.291321       NaN  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [133]:
df.dropna(thresh= 6, axis=1)

          0
0  0.302053
1 -0.463459
2 -0.455859
3 -0.291321
4 -0.180204
5 -0.608157
6  0.266230

#### 1.2 결측치 채우기

In [134]:
df

          0         1         2
0  0.302053       NaN       NaN
1 -0.463459       NaN       NaN
2 -0.455859       NaN  1.851914
3 -0.291321       NaN  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [135]:
df.fillna(0)

          0         1         2
0  0.302053  0.000000  0.000000
1 -0.463459  0.000000  0.000000
2 -0.455859  0.000000  1.851914
3 -0.291321  0.000000  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [136]:
df.fillna({1:0.5, 2:0})

          0         1         2
0  0.302053  0.500000  0.000000
1 -0.463459  0.500000  0.000000
2 -0.455859  0.500000  1.851914
3 -0.291321  0.500000  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [137]:
df.fillna(0, inplace=True)
df

          0         1         2
0  0.302053  0.000000  0.000000
1 -0.463459  0.000000  0.000000
2 -0.455859  0.000000  1.851914
3 -0.291321  0.000000  0.295697
4 -0.180204 -0.242208 -0.875043
5 -0.608157  0.591696  0.743245
6  0.266230 -2.375949  1.100389

In [138]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -0.069732 -0.532156 -0.546144
1  0.657686 -0.924026  1.340713
2 -1.757605  0.805774  0.217118
3 -1.130926  0.897476  1.059556
4  0.369159  0.043288 -0.274939
5  0.380650 -0.060723  0.293725

In [139]:
df.iloc[2:, 1] = NA
df

          0         1         2
0 -0.069732 -0.532156 -0.546144
1  0.657686 -0.924026  1.340713
2 -1.757605       NaN  0.217118
3 -1.130926       NaN  1.059556
4  0.369159       NaN -0.274939
5  0.380650       NaN  0.293725

In [140]:
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.069732 -0.532156 -0.546144
1  0.657686 -0.924026  1.340713
2 -1.757605       NaN  0.217118
3 -1.130926       NaN  1.059556
4  0.369159       NaN       NaN
5  0.380650       NaN       NaN

In [141]:
df.fillna(method='ffill')

          0         1         2
0 -0.069732 -0.532156 -0.546144
1  0.657686 -0.924026  1.340713
2 -1.757605 -0.924026  0.217118
3 -1.130926 -0.924026  1.059556
4  0.369159 -0.924026  1.059556
5  0.380650 -0.924026  1.059556

In [142]:
df.fillna(method='ffill', axis=1)

          0         1         2
0 -0.069732 -0.532156 -0.546144
1  0.657686 -0.924026  1.340713
2 -1.757605 -1.757605  0.217118
3 -1.130926 -1.130926  1.059556
4  0.369159  0.369159  0.369159
5  0.380650  0.380650  0.380650

In [143]:
df

          0         1         2
0 -0.069732 -0.532156 -0.546144
1  0.657686 -0.924026  1.340713
2 -1.757605       NaN  0.217118
3 -1.130926       NaN  1.059556
4  0.369159       NaN       NaN
5  0.380650       NaN       NaN

In [144]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.069732 -0.532156 -0.546144
1  0.657686 -0.924026  1.340713
2 -1.757605 -0.924026  0.217118
3 -1.130926 -0.924026  1.059556
4  0.369159       NaN  1.059556
5  0.380650       NaN  1.059556

In [146]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [147]:
data.mean()

3.8333333333333335

In [149]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 2. 데이터 변형

### 2.1 중복 제거하기

In [150]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [151]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [153]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [154]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [156]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [157]:
data.drop_duplicates(['k1'], keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [158]:
data.drop_duplicates(['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [159]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 2.2 함수나 매핑을 이용해서 변형하기

In [160]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [161]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [164]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [166]:
data['animal'] = lowercased.map(meat_to_animal)   # map 함수에 collection을 매핑해서 변환

In [167]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [ ]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [168]:
meat_to_animal['bacon']

'pig'

In [171]:
def f(x):
    return meat_to_animal[x.lower()]

In [172]:
data['food'].map(f)   # map에 함수를 적용해서 변환

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [173]:
data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 2.3 값 치환하기

In [174]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [175]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [176]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [177]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [179]:
data.replace({-999 : np.nan, -1000 : 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 2.4 축 색인 이름 바꾸기

In [180]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [181]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [182]:
transform = lambda x: x.upper()

In [183]:
data.index.map(transform)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [184]:
transform = lambda x: x[:4].upper()

In [185]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [186]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [189]:
data.rename(index = str.title, columns= str.title)

          One  Two  Three  Four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [190]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [193]:
data.rename(index = {'Ohio' : 'INDIANA'}, inplace=True)

In [194]:
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

### 2.5 개별화와 양자화

In [196]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [195]:
bins = [18, 25, 35, 60, 100]

In [200]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [201]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [202]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [203]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [204]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [205]:
 pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [206]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [207]:
 pd.cut(ages, bins, labels= group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [210]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

In [213]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(-0.00831, 0.673], (-3.564, -0.619], (-0.619, -0.00831], (-0.619, -0.00831], (-0.00831, 0.673], ..., (-3.564, -0.619], (-0.619, -0.00831], (-3.564, -0.619], (-0.00831, 0.673], (-0.00831, 0.673]]
Length: 1000
Categories (4, interval[float64]): [(-3.564, -0.619] < (-0.619, -0.00831] < (-0.00831, 0.673] < (0.673, 2.967]]

In [214]:
pd.value_counts(cats)

(-3.564, -0.619]      250
(-0.619, -0.00831]    250
(-0.00831, 0.673]     250
(0.673, 2.967]        250
dtype: int64

In [215]:
q = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])
q

[(-0.00831, 1.217], (-1.274, -0.00831], (-1.274, -0.00831], (-1.274, -0.00831], (-0.00831, 1.217], ..., (-1.274, -0.00831], (-1.274, -0.00831], (-1.274, -0.00831], (-0.00831, 1.217], (-0.00831, 1.217]]
Length: 1000
Categories (4, interval[float64]): [(-3.564, -1.274] < (-1.274, -0.00831] < (-0.00831, 1.217] < (1.217, 2.967]]

In [216]:
pd.value_counts(q)

(-1.274, -0.00831]    400
(-0.00831, 1.217]     400
(-3.564, -1.274]      100
(1.217, 2.967]        100
dtype: int64

### 2.6 특잇값을 찾고 제외하기

In [217]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [218]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017928     0.026616     0.010033     0.050457
std       1.007779     1.019662     0.973488     1.014961
min      -2.796990    -2.905040    -3.046212    -3.478919
25%      -0.700757    -0.696932    -0.631292    -0.579367
50%      -0.027844     0.037470     0.006237     0.023845
75%       0.691397     0.737066     0.662193     0.695224
max       3.306541     3.140196     3.105557     4.210027

In [221]:
np.abs(data) > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [224]:
(np.abs(data) > 3).any(1)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [225]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
155  0.454965 -0.105830  0.405595 -3.478919
235  1.365291  3.140196 -0.483406 -0.299139
405  0.494554 -0.723784 -3.046212  0.102138
479 -0.083442 -0.552336  0.834401  4.210027
486  3.037553  1.297747  0.048212  0.664894
..        ...       ...       ...       ...
746  1.077000  0.280317  3.105557  0.980058
774  1.010574 -0.838045 -0.639910  3.075638
835  3.306541  1.076412 -1.408487 -1.414662
969 -1.258986  0.702721 -0.409151  3.318338
994 -0.421555 -0.438651  0.562208  3.046121

[12 rows x 4 columns]

In [226]:
np.abs(data) > 3

         0      1      2      3
0    False  False  False  False
1    False  False  False  False
2    False  False  False  False
3    False  False  False  False
4    False  False  False  False
..     ...    ...    ...    ...
995  False  False  False  False
996  False  False  False  False
997  False  False  False  False
998  False  False  False  False
999  False  False  False  False

[1000 rows x 4 columns]

In [228]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [229]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017578     0.026476     0.009974     0.049372
std       1.006693     1.019243     0.973013     1.007540
min      -2.796990    -2.905040    -3.000000    -3.000000
25%      -0.700757    -0.696932    -0.631292    -0.579367
50%      -0.027844     0.037470     0.006237     0.023845
75%       0.691397     0.737066     0.662193     0.695224
max       3.000000     3.000000     3.000000     3.000000

In [230]:
data.values.clip(-1, 1) # numpy

array([[-0.5952909 , -0.98479284, -0.4436308 ,  0.65121692],
       [-1.        , -0.64023946,  1.        , -0.47267302],
       [-0.23422652,  0.94622066, -0.08828878,  1.        ],
       ...,
       [-1.        ,  0.81333051,  0.70827456, -1.        ],
       [ 0.22261406, -0.75555521,  1.        ,  0.7717869 ],
       [ 0.2397749 , -0.86588009, -0.49957885,  0.64696028]])

* 참고 : 넘파이 clip 사용법

In [231]:
new_data = data.values.clip(-3, 3)

In [232]:
new_data.max()

3.0

In [233]:
new_data.min()

-3.0

### 2.7 치환과 임의 샘플링

In [234]:
df = pd.DataFrame(np.arange(20).reshape((5,4)))

In [237]:
df #5행

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [238]:
sampler = np.random.permutation(5)
sampler

array([2, 1, 4, 0, 3])

In [239]:
df.iloc[sampler]

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [240]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [242]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [244]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [245]:
choices = pd.Series([5, 7, -1, 6, 4])

In [246]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [249]:
choices.sample(n=3)

0    5
1    7
2   -1
dtype: int64

In [251]:
choices.sample(n=10, replace=True)

2   -1
3    6
2   -1
4    4
0    5
0    5
0    5
1    7
3    6
4    4
dtype: int64